# Station Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
HorizontalCurveEndpoint..::..Station Property
HorizontalCurveEndpoint Class See Also
---
The endpoint's station value.
**Namespace:** Autodesk.Revit.DB.Infrastructure**Assembly:** Autodesk.CivilAlignments.DBApplication (in Autodesk.CivilAlignments.DBApplication.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021.1
# Syntax
C#
---
```text
public double Station { get; internal set; }
```

Visual Basic
---
```text
Public Property Station As Double
	Get
	Friend Set
```

Visual C++
---
```text
public:
property double Station {
	double get ();
	internal: void set (double value);
}
```

# See Also
HorizontalCurveEndpoint Class
Autodesk.Revit.DB.Infrastructure Namespace